read -sv src/adder_2bit.v
read -sv src/full_adder.v
hierarchy -top adder_2bit
#prep -top adder_2bit -flatten
proc; opt; techmap; opt
write_json output/synth.json
