read -sv src/ripple_carry_adder.v
read -sv src/full_adder.v
hierarchy -top ripple_carry_adder
#prep -top ripple_carry_adder -flatten
proc; opt; techmap; opt
write_json output/synth.json
